{
  "7994": "Hi my name is Stacy Hi I'm Pat, Hi I'm Chris",
  "9908": "Hi my name is Lisa",
  "14558": "we are People Making Progress, a nonprofit organization providing services to adults with developmental disabilities so they may live work and thrive in the community.",
  "25870": "In this video, we will show you what we do and what your help would mean to somebody with",
  "29177": "a developmental disability in the Atlanta area.",
  "33721": "\"We learned about PMP from Dorothy Miller when she wanted to start the program and she got approved with parents together in her kitchen and we all just got together and said,",
  "46270": "let's do it!\"",
  "48293": "Dorothy Miller's extraordinary love and dedication to her family of 11 adopted children with disabilities, and her vision of what their adult lives could become, has blossomed into a company that now serves many more individuals in all areas of their lives.",
  "63123": "At work, at home, or out in the community, our company helps",
  "66270": "people become as independent as possible and reach their own personal goals.",
  "74413": "\"John is very proud that he has a job he's been there for 29 years, and he had the same boss for 15 years",
  "82688": "so he in the boss and I kind of worked together to make it work for him, and then that boss leaves and another one comes  in and this is where PMP comes in.",
  "92344": "They do what I used to do, only better.\"",
  "95265": "We provide training and job coaching to help those with a developmental disability secure employment and succeed once they have found a job. Many members of our programs have been with the same employers for more than a decade and  continue to be dedicated, reliable employees.",
  "113149": "We also volunteer with local nonprofits, including the Atlanta Assistance League in the Atlanta Community Food Bank.",
  "119744": "Participants get the structure and satisfaction of going to work every day, get to know people in their communities, and make a meaningful difference in the lives of others.",
  "128653": "Our thousands of hours of volunteer service governed us the Presidential Gold award each year since 2010.",
  "136776": "\"Right now we volunteer in quite a few different sites",
  "141787": "Most have volunteered for many years in those sites so they know",
  "146245": "the employees there,",
  "149613": "the tasks there.",
  "151607": "\"Working with the people making progress folks is awesome, these guys have been coming so long, they are complete professionals at this particular task\"",
  "167869": "\"it's been a pleasure, they definitely help us in contributing to the mission at the food bank.\"",
  "173534": "\"Today we are at Atlanta Assistance League.",
  "177092": "We are assembling hygiene kits for the homeless men,",
  "180934": "they go to Gateway.",
  "184268": "We stay for about 2 hours - and do about 3000 a month.\"",
  "193400": "Independence in daily living is a basic dignity that many of us take for granted. In supporting people in their homes PMP encourages them to grow more independent year after year, and take pride in managing their own affairs so they can enjoy life to the fullest.",
  "207733": "\"Karen is definitely a joy to work with",
  "212577": "like most people she is very social",
  "215491": "and so we're making sure that the activities of daily living are met, so that when it's time to go bowling, and time to go swimming, and time to go and and enjoy her friends out the community that the activities that we have to get done are done.\"",
  "235434": "\"She's been in the residential program for 20 years,",
  "239066": "and it's probably the best thing we ever did for her\"",
  "243150": "\"I feel that my children's very settled",
  "245739": "it's a great comfort to its to know that we finally gotten to where we want to be\"",
  "250680": "\"I mean, without People Making Progress,",
  "253401": "Karen  would not have advanced as far as she is, and be as",
  "257327": "independent as she has become, so we thank God every day for People Making Progress.\"",
  "263362": "",
  "267141": "PMP is a CARF  accredited 501 c 3 non-profit based in Tucker Georgia area. We are small organization but with your help can do more. We want to provide 365 day support to those that need it, increase the number of individuals we serve, and be ready to act on   needs and opportunities we see in our community.",
  "287240": "For information on how to donate or get a matching donation from your organization please call, or see our website at PeopleMakingProgressINC.Org    ",
  "297918": "thank you thank you thank you bye goodbye I'll see you soon"
}